[
  {
    "id": "mimecast",
    "name": "Mimecast",
    "slug": "/mimecast",
    "description": "Mimecast is a spam filter, block list, and firewall solution for promoted for businesses, headquartered in London. Mail is routed through mailservers owned by Mimecast (*.mimecast.com) before it's passed along to the recipient domain's mailservers for final delivery. The recipient is able to manage a lot of delivery settings such as spam policy levels and overrides (allow lists).",
    "links": [
      "https://community.mimecast.com/s/article/Mimecast-SMTP-Error-Codes-842605754#451"
    ]
  },
  {
    "id": "trendmicro",
    "name": "TrendMicro",
    "slug": "/trendmicro",
    "description": "TrendMicro is a spam filter, block list, and firewall solution for promoted for businesses, headquartered in Tokyo. Mail is routed through mailservers owned by TrendMicro (example: *.trendmicro.com). The recipient is able to manage a lot of delivery settings such as spam policy levels and overrides (allow lists).",
    "links": [
      "https://docs.trendmicro.com/en-us/enterprise/deep-discovery-email-inspector-36/administration_001/sender-filtering.aspx"
    ]
  },
  {
    "id": "proofpoint",
    "name": "Proofpoint",
    "slug": "/proofpoint",
    "description": "Proofpoint is a spam filter, block list, and firewall promoted for businesses, headquartered in California. Mail is routed through mailservers owned by Proofpoint (*.ppe-hosted.com) before it's passed along to the recipient domain's mailservers for final delivery. The recipient is able to manage a lot of delivery settings such a allow lists and spam filtering policy levels. For globally-blocked IPs, the adminstrator of the IP will need to request delisting directly.",
    "links": [
      "https://help.proofpoint.com/Proofpoint_Essentials/Email_Security/User_Topics/040_spamsettings/041_adjustingyourspamsettings",
      "https://help.proofpoint.com/Proofpoint_Essentials/Email_Security/Administrator_Topics/110_logs/Common_Error_Codes_found_in_Message_Details",
      "https://help.proofpoint.com/Proofpoint_Essentials/Email_Security/Administrator_Topics/Other_Features/Proofpoint_Dynamic_Reputation_(PDR)_IP_blocklisting_and_IP_address_removal"
    ]
  },
  {
    "id": "barracuda",
    "name": "Barracuda",
    "slug": "/barracuda",
    "description": "Barracuda is a spam filter, block list, and firewall promoted for businesses, headquartered in California. Mail is routed through mailservers owned by Barracuda before it's passed along to the recipient domain's mailservers for final delivery. The recipient is able to manage a lot of delivery settings such as allow lists, but sender reputation issues that affect all Barracuda customers globally may require contacting Barracuda support directly to resolve.",
    "links": [
      "https://campus.barracuda.com/product/emailsecuritygateway/doc/39815000/smtp-error-codes/"
    ]
  },
  {
    "id": "emailsecuritycloud",
    "name": "Email Security.cloud",
    "slug": "/emailsecuritycloud",
    "description": "\"Email Security.cloud\" is a product working in combination with \"Symantec Messaging Gateway\" as part of a range of services offered by Broadcom, headquartered in California. It features spam filtering, firewall protection, and block lists with resource guides of detailed troubleshooting steps for email delivery. Additionally, a legitimate email which has been incorrectly given a verdict of spam can be submitted to Symantec for analysis and filter review.",
    "links": [
      "https://knowledge.broadcom.com/external/article/165144/smtp-bounce-back-error-codes-for-email-s.html",
      "https://ipremoval.sms.symantec.com/"
    ]
  },
  {
    "id": "zerospam",
    "name": "ZeroSpam",
    "slug": "/zerospam",
    "description": "ZeroSpam is a spam filter, block list, and firewall promoted for businesses, headquartered in Quebec. Mail is routed through mailservers owned by ZeroSpam before it's passed along to the recipient domain's mailservers for final delivery. The recipient is able to manage a lot of delivery settings such as allow lists, but senders may also be able to contact a postmaster@zerospam.com and abuse@zerospam.com address to get more in-depth analysis.",
    "links": [
      "https://help.cumulussmtp.com/article/21-managing-filtering-parameters",
      "https://www.zerospam.ca/en/press-and-media-blog-archives/archive-template-5/archive-email-best-practices"
    ]
  },
  {
    "id": "cisco",
    "name": "Cisco",
    "slug": "/cisco",
    "description": "\"Cisco Secure Email\" is a spam filter, block list, and firewall solution promoted for businesses, headquartered in California. Mail is routed through mailservers owned by Cisco (imphmx.com) before it's passed along to the recipient domain's mailservers for final delivery. The recipient is able to manage a lot of delivery settings such a allow lists, so it helps to ask the recipient to run the described debugging tests in Cisco's User Guide to identify and resolve delivery issues.",
    "links": [
      "https://www.cisco.com/c/en/us/td/docs/security/esa/esa12-0/user_guide/b_ESA_Admin_Guide_12_0/b_ESA_Admin_Guide_12_0_chapter_0101001.html"
    ]
  },
  {
    "id": "exchangeonline",
    "name": "Exchange Online",
    "slug": "/exchangeonline",
    "description": "Exchange Online an email provider, headquartered in Washington as part of Microsoft. It's offered by both Office 365 and Microsoft 365, providing businesses with spam filtering, block lists, and firewall protection. If a message is going to spam or getting blocked, there are typically instructions for the email admin to fix the specific error in Exchange documentation.",
    "links": [
      "https://docs.microsoft.com/en-us/exchange/mail-flow-best-practices/non-delivery-reports-in-exchange-online/non-delivery-reports-in-exchange-online",
      "https://sender.office.com/"
    ]
  }
]
